In [1]:
import pandas as pd,numpy as np,matplotlib.pyplot as plt,seaborn as sns

In [2]:
dict1={'Name':['vignesh','Nani',np.nan,'siri'],'Age':[np.nan,21,32,43],'City':['Chi','Bpt','Ong',np.nan]}

In [4]:
d1=pd.DataFrame(dict1)

In [6]:
d1.dtypes

Name     object
Age     float64
City     object
dtype: object

In [18]:
dict2={'Name':['vignesh','Nani',np.nan,'siri'],'Age':[np.nan,21,32,43],'City':['Chi','Bpt','Ong',np.nan]}

In [19]:
d2=pd.DataFrame(dict2)

In [20]:
d2.isnull()

    Name    Age   City
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

In [21]:
d2.isnull().sum()

Name    1
Age     1
City    1
dtype: int64

- **Method-1**
- **Fill with some random value**
- **Method name:fill na**

In [22]:
d2.isnull().sum()*100/len(d2)

Name    25.0
Age     25.0
City    25.0
dtype: float64

In [23]:
d2.fillna(40)

      Name   Age City
0  vignesh  40.0  Chi
1     Nani  21.0  Bpt
2       40  32.0  Ong
3     siri  43.0   40

**Method-2**

In [26]:
d2['Age'].fillna(40,inplace=True)

In [27]:
d2

      Name   Age City
0  vignesh  40.0  Chi
1     Nani  21.0  Bpt
2      NaN  32.0  Ong
3     siri  43.0  NaN

In [28]:
d2['Name'].fillna(40,inplace=True)
d2

      Name   Age City
0  vignesh  40.0  Chi
1     Nani  21.0  Bpt
2       40  32.0  Ong
3     siri  43.0  NaN

In [29]:
d2['City'].fillna(40,inplace=True)
d2

      Name   Age City
0  vignesh  40.0  Chi
1     Nani  21.0  Bpt
2       40  32.0  Ong
3     siri  43.0   40

 **Method-3**

In [36]:
d1.fillna(method='bfill',axis=1)

      Name   Age City
0  vignesh   Chi  Chi
1     Nani  21.0  Bpt
2     32.0  32.0  Ong
3     siri  43.0  NaN

In [35]:
d1.fillna(method='ffill',axis=1)

      Name      Age  City
0  vignesh  vignesh   Chi
1     Nani     21.0   Bpt
2      NaN     32.0   Ong
3     siri     43.0  43.0

In [34]:
d1.fillna(method='backfill',axis=1)

      Name   Age City
0  vignesh   Chi  Chi
1     Nani  21.0  Bpt
2     32.0  32.0  Ong
3     siri  43.0  NaN

In [40]:
dict1={'Name':['vignesh','Nani',np.nan,'siri'],'Age':[np.nan,21,32,43],'City':['Chi','Bpt','Ong',np.nan]}
d1=pd.DataFrame(dict1)
d1

      Name   Age City
0  vignesh   NaN  Chi
1     Nani  21.0  Bpt
2      NaN  32.0  Ong
3     siri  43.0  NaN

In [38]:
age_mean=d1['Age'].mean()
d1['Age'].fillna(age_mean)

0    32.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [39]:
age_mediam=d1['Age'].median()
d1['Age'].fillna(age_mediam)

0    32.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [41]:
age_mode=d1['Age'].mode()
d1['Age'].fillna(age_mode)

0    21.0
1    21.0
2    32.0
3    43.0
Name: Age, dtype: float64

In [42]:
age_mode=d1['City'].mode()
d1['City'].fillna(age_mode)

0    Chi
1    Bpt
2    Ong
3    NaN
Name: City, dtype: object

**Methode-5**
**KNN imputer**

In [44]:
from sklearn.impute import KNNImputer
knn=KNNImputer()

In [45]:
knn.fit_transform(d1[['Age']])

array([[32.],
       [21.],
       [32.],
       [43.]])